#include <iostream>

//Проект игры космические захватчики
// 
// Осн. класс - Game
//		отвечает за основной игровой цикл
//		должен управлять сложностью игры
//		и в уелом быть оболочкой для игровой логики программы
// 
// Игровое поле - Scene
//		Должна знать расположение объектов и чем они являются
// 
// Класс игрового объекта - базовый класс для всего что может быть
//		расположено на игровой сцены
// 
// Класс координат
//		Для запоминания позиции
// 
// Игроки, спрайты, снаряды и прочее будетнаследниками игрового объекта
//


int main()
{

	return 0;
}